In [ ]:
# ---- UTILIZANDO a BASE MUSIC_STORE

In [21]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('data/music-store.db')
def consulta(query):
    return pd.read_sql(query, conn)

In [125]:
# Qual artista possui mais albuns? 

consulta("""
         SELECT
            a.name ActorName,
         COUNT(ab.id) as QtyAlbums
         FROM artists a
            INNER JOIN albums ab 
            ON a.id = ab.artist_id 
         GROUP BY artist_id
         ORDER BY QtyAlbums DESC
         LIMIT 1
         """)

     ActorName  QtyAlbums
0  Iron Maiden         21

In [31]:
# Existem clientes de quantos países? 

consulta("SELECT COUNT (DISTINCT country) AS qty_contries FROM CUSTOMERS")

   Qty_Contries
0            24

In [63]:
# Consultar quantidades de clientes por países

consulta("""
         SELECT 
            country,
         COUNT(id) as qty_client 
         FROM customers c
         GROUP BY country
         ORDER BY qty_client DESC
         """)

           country  qty_client
0              USA          13
1           Canada           8
2           France           5
3           Brazil           5
4          Germany           4
5   United Kingdom           3
6         Portugal           2
7            India           2
8   Czech Republic           2
9           Sweden           1
10           Spain           1
11          Poland           1
12          Norway           1
13     Netherlands           1
14           Italy           1
15         Ireland           1
16         Hungary           1
17         Finland           1
18         Denmark           1
19           Chile           1
20         Belgium           1
21         Austria           1
22       Australia           1
23       Argentina           1

In [64]:
consulta("""
         SELECT
            country, 
         COUNT(id) as qty_client
         FROM customers c
         WHERE country='Brazil'
         GROUP BY country 
         ORDER BY qty_client DESC
         """)

  country  qty_client
0  Brazil           5

In [65]:
# Qual genero possui mais músicas?

consulta("""
         SELECT
            g.name genres,
         COUNT(genre_id) as qty_genres
         FROM tracks t
            INNER JOIN genres g 
            ON t.genre_id = g.id
         GROUP BY genres
         ORDER BY qty_genres DESC
         LIMIT 1
         """)

  genres  qty_genres
0   Rock        1297

In [66]:
# Qual genero possui mais albuns? 

consulta("""
         SELECT
            g.name genres,
         COUNT(DISTINCT album_id) as qty_albums
         FROM tracks t
            INNER JOIN genres g 
            ON t.genre_id = g.id
         GROUP BY genres
         ORDER BY qty_albums DESC
         LIMIT 1    
         """)

  genres  qty_albums
0   Rock         117

In [68]:
# Existem albuns que possuem mais de um gênero 

consulta("""
            SELECT 
                album_id, COUNT(DISTINCT genre_id) AS qty_genres
            FROM Tracks
            GROUP BY album_id
            ORDER BY qty_genres DESC 
""")

     album_id  qty_genres
0         141           3
1         227           3
2          73           2
3         102           2
4         109           2
..        ...         ...
342       343           1
343       344           1
344       345           1
345       346           1
346       347           1

[347 rows x 2 columns]

In [70]:
# Exiba os 5 clientes que mais fizeram pedidos. Qual é o valor da maior compra?

consulta("""
         SELECT
            customer_id,
            first_name ||' '|| last_name fullname,
        COUNT(i.id) as qty_order,
        SUM(total) as total_order
        FROM invoices i
            INNER JOIN customers c 
            ON i.customer_id = c.id 
        GROUP BY fullname
        ORDER BY qty_order DESC, total_order DESC
        LIMIT 5   
         """)

   customer_id            fullname  qty_order  total_order
0            6         Helena Holý          7        49.62
1           26  Richard Cunningham          7        47.62
2           57          Luis Rojas          7        46.62
3           46       Hugh O'Reilly          7        45.62
4           45     Ladislav Kovács          7        45.62

In [71]:
# Quais os emails dos 10 clientes que mais gastaram na loja? 

consulta("""
         SELECT
            customer_id,
            first_name ||' '|| last_name as fullname,
            email,
        SUM(total) total_price
        FROM invoices i
            INNER JOIN customers c 
            ON i.customer_id = c.id 
        GROUP BY fullname
        ORDER BY total_price DESC
        LIMIT 10   
         """)

   customer_id            fullname                     email  total_price
0            6         Helena Holý           hholy@gmail.com        49.62
1           26  Richard Cunningham  ricunningham@hotmail.com        47.62
2           57          Luis Rojas        luisrojas@yahoo.cl        46.62
3           45     Ladislav Kovács  ladislav_kovacs@apple.hu        45.62
4           46       Hugh O'Reilly      hughoreilly@apple.ie        45.62
5           28       Julia Barnett       jubarnett@gmail.com        43.62
6           37     Fynn Zimmermann      fzimmermann@yahoo.de        43.62
7           24       Frank Ralston        fralston@gmail.com        43.62
8           25      Victor Stevens        vstevens@yahoo.com        42.62
9            7       Astrid Gruber    astrid.gruber@apple.at        42.62

In [14]:
# Qual o valor médio de cada compra? 

consulta('SELECT AVG(total) AS avg_price FROM invoices')

   avg_price
0   5.651942

In [29]:
# Quantas compras estão acima da média?

consulta("""
        SELECT 
        COUNT(total) AS avg_price,
        CASE
            WHEN total > (SELECT AVG(total) AS avg_price FROM invoices) THEN 'AcimaAVG'
            WHEN total < (SELECT AVG(total) AS avg_price FROM invoices) THEN 'abaixoAVG'
        END as categoria
        FROM invoices
        WHERE categoria = 'AcimaAVG'
        GROUP BY categoria  
        """)

   avg_price categoria
0        179  AcimaAVG

In [53]:
# Vamos fazer uma playlist com as 12 músicas mais vendidas! 
# Quais foram elas? Quais os generos e os artistas?

consulta("""SELECT
                t.id trackID,
                t.name musicname,
                at.name artist,
                g.name genre,
            COUNT(track_id) qtytracksold
            FROM invoice_lines il
                INNER JOIN tracks t
                ON il.track_id = t.id
                INNER JOIN genres g
                ON g.id = t.genre_id
                INNER JOIN albums a
                ON a.id = t.album_id
                INNER JOIN artists at
                ON at.id = a.artist_id
             GROUP BY trackID
             ORDER BY qtyTracksold DESC
             LIMIT 12   
            """)

,trackID,musicname,artist,genre,qtytracksold
0,2,Balls to the Wall,Accept,Rock,2
1,8,Inject The Venom,AC/DC,Rock,2
2,9,Snowballed,AC/DC,Rock,2
3,20,Overdose,AC/DC,Rock,2
4,32,Deuces Are Wild,Aerosmith,Rock,2
5,48,Not The Doctor,Alanis Morissette,Rock,2
6,66,Por Causa De Você,Antônio Carlos Jobim,Jazz,2
7,84,Welcome Home (Sanitarium),Apocalyptica,Metal,2
8,161,Snowblind,Black Sabbath,Metal,2
9,162,Cornucopia,Black Sabbath,Metal,2
10,171,Bowels Of The Devil,Body Count,Alternative & Punk,2
11,175,Voodoo,Body Count,Alternative & Punk,2

In [ ]:
# DESAFIO DO PROF: Precisamos definir 2 países para ações de marketing. 
# Para um, iremos direcionar campanhas dos albums mais caros, 
# nosso foco são os clientes que não se preocupam com o valor do pedido. 
# Para o outro grupo, que gasta menos, precisamos ser mais assertivos, 
# ecomendando albums mais baratos mas com músicas populares. 
# Qual seria sua estratégia? Quais países poderíamos atender? 
# Quais albuns iremos recomendar para cada um dos países? 
# Apresente a query (ou as queries), a tabela (ou as tabelas) 
# e justifique suas escolhas.

In [72]:
# Lista dos 20 países que possuem o maior valor per capita de vendas por pessoa

consulta("""
         SELECT
            c.country nationality,
        COUNT(DISTINCT c.id) as qty_customer,
        COUNT(i.id) as qty_invoices,
        SUM(total) as total_amount,
        SUM(total)/COUNT(DISTINCT c.id) PC,
        SUM(total)/COUNT(i.id) PC2
        FROM invoices i
            INNER JOIN customers c 
            ON i.customer_id = c.id 
        GROUP BY nationality
        ORDER BY PC DESC, PC2 DESC, total_amount DESC
        LIMIT 20   
         """)

,nationality,qty_customer,qty_invoices,total_amount,PC,PC2
0,Chile,1,7,46.62,46.620000,6.660000
1,Hungary,1,7,45.62,45.620000,6.517143
2,Ireland,1,7,45.62,45.620000,6.517143
3,Czech Republic,2,14,90.24,45.120000,6.445714
4,Austria,1,7,42.62,42.620000,6.088571
5,Finland,1,7,41.62,41.620000,5.945714
6,Netherlands,1,7,40.62,40.620000,5.802857
7,USA,13,91,523.06,40.235385,5.747912
8,Norway,1,7,39.62,39.620000,5.660000
9,Germany,4,28,156.48,39.120000,5.588571
10,France,5,35,195.10,39.020000,5.574286
11,Sweden,1,7,38.62,38.620000,5.517143
12,Portugal,2,14,77.24,38.620000,5.517143
13,Brazil,5,35,190.10,38.020000,5.431429
14,Canada,8,56,303.96,37.995000,5.427857
15,India,2,13,75.26,37.630000,5.789231
16,Argentina,1,7,37.62,37.620000,5.374286
17,Australia,1,7,37.62,37.620000,5.374286
18,Denmark,1,7,37.62,37.620000,5.374286
19,Italy,1,7,37.62,37.620000,5.374286

In [74]:
# Lista dos 10 albuns mais caros

consulta ("""
            SELECT
                a.id albumID,
                a.title albumname,
                at.name artistname,
                SUM(unit_price) albumprice,
                COUNT(t.id) hits   
            FROM tracks t
            JOIN albums a
                ON t.album_id = a.id
            JOIN artists at
                ON a.artist_id = at.id
            GROUP BY albumname
            ORDER BY albumprice DESC
            LIMIT 10
        """)

,albumID,albumname,artistname,albumprice,hits
0,141,Greatest Hits,Lenny Kravitz,56.43,57
1,229,"Lost, Season 3",Lost,51.74,26
2,251,"The Office, Season 3",The Office,49.75,25
3,230,"Lost, Season 1",Lost,49.75,25
4,231,"Lost, Season 2",Lost,47.76,24
5,253,"Battlestar Galactica (Classic), Season 1",Battlestar Galactica (Classic),47.76,24
6,228,"Heroes, Season 1",Heroes,45.77,23
7,250,"The Office, Season 2",The Office,43.78,22
8,227,"Battlestar Galactica, Season 3",Battlestar Galactica,37.81,19
9,261,"LOST, Season 4",Lost,33.83,17